---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadFillingSpacing
source: html/b635dc6e-641e-04ef-30c7-42b7eb1df71d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadFillingSpacing Property

Spacing for Excess Length Fill is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadFillingSpacing { get; }
```